In [37]:
#import necessary libraries
import pandas as pd

In [38]:
#import the dataset
df = pd.read_csv('/home/labuser/Downloads/purchases.csv')

## Data Preprocessing

In [39]:
df.head(1)

  Unnamed: 0  apples  oranges
0       June       3        0

In [40]:
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   apples      4 non-null      int64
 2   oranges     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [42]:
df.shape

(4, 3)

In [43]:
df.columns

Index(['Unnamed: 0', 'apples', 'oranges'], dtype='object')

In [44]:
index = pd.Index(range(4, len(df)+4, 1))

In [45]:
df.set_index(index)

  Unnamed: 0  apples  oranges
4       June       3        0
5     Robert       2        3
6       Lily       0        7
7      David       1        2

In [46]:
df.rename(columns = {'Unnamed: 0':'Names'}, inplace=True)

In [47]:
df

    Names  apples  oranges
0    June       3        0
1  Robert       2        3
2    Lily       0        7
3   David       1        2

In [49]:
# converting column values to upper

df['Names'] = df['Names'].str.upper()

In [50]:
df

    Names  apples  oranges
0    JUNE       3        0
1  ROBERT       2        3
2    LILY       0        7
3   DAVID       1        2

In [52]:
df[df['apples']>1]

    Names  apples  oranges
0    JUNE       3        0
1  ROBERT       2        3